def get_dict_query():
    dict_query = {'Создать таблицы в BD': """
        SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
        SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;
        SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION';

        CREATE TABLE IF NOT EXISTS habits (
        id BIGINT(9) NOT NULL AUTO_INCREMENT,
        user_id BIGINT(9) NOT NULL,
        name TINYTEXT NOT NULL,
        frequency ENUM('ежедневно', 'еженедельно', 'ежемесячно', 'ежегодно', 'произвольно') NOT NULL DEFAULT 'произвольно',
        created_at DATE NOT NULL,
        PRIMARY KEY (id))
        ENGINE = InnoDB;

        CREATE TABLE IF NOT EXISTS habit_checks (
        id BIGINT(9) NOT NULL AUTO_INCREMENT,
        habits_id BIGINT(9) NOT NULL,
        check_date DATE NOT NULL,
        note VARCHAR(45) NULL DEFAULT 'Null',
        INDEX fk_habit_checks_habits_idx (habits_id ASC),
        PRIMARY KEY (id),
        CONSTRAINT fk_habit_checks_habits
        FOREIGN KEY (habits_id)
        REFERENCES habits (id)
        ON DELETE CASCADE
        ON UPDATE NO ACTION)
        ENGINE = InnoDB;

        SET SQL_MODE=@OLD_SQL_MODE;
        SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS;
        SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS;
        """,
                  'Добавить привычку':'''INSERT INTO habits (user_id, name, frequency, created_at)
                  VALUES (%s, %s, %s, %s);''',
                  'Список привычек':'SELECT * FROM habits WHERE user_id = %s',
                  'Список id привычек':'SELECT id FROM habits WHERE user_id = %s',
                  'Привычка':'SELECT * FROM habits WHERE id = %s',
                  'Отметка':'SELECT check_date FROM habit_checks WHERE habits_id = %s',
                  'Создать отметку':'''INSERT INTO habit_checks (habits_id, check_date, note)
                  VALUES (%s, %s, %s);''',
                  'Удалить привычку':'DELETE FROM habits WHERE id = %s',
                  'Удалить отметку':'DELETE FROM habit_checks WHERE habits_id = %s AND check_date = %s',
                  'Все даты отметок':'SELECT check_date FROM habit_checks WHERE habits_id = %s',
                  'Период дат отметок':'SELECT check_date FROM habit_checks WHERE habits_id = %s'
                                       ' AND check_date BETWEEN %s AND %s;',
                  'Редактировать привычку':'UPDATE habits SET name = %s, frequency = %s WHERE id = %s;',
                  'Привычки пользователя':'SELECT id FROM habits WHERE user_id = %s',
                  }
    return dict_query

def get_dict_info_for_user() -> dict:
    info_for_user = {
        'Приветствие':'''Приветствую Вас {username} 👋, я ваш персональный помощник по созданию привычек, и 
ведению статистики их выполнения.\n\nС командами выполнения можете ознакомиться набрав команду:\n/help''',
        'Команды':f'Список моих доступных команд:\n/start - приветствие, с описанием чат бота;\n{'*'*31}\n'
                  f'/help - список доступных команд;\n{'*'*31}\n'
                  f'/add_habits - добавить привычку, формат:\n/add_habits пить воду | ежедневно;\n{'*'*31}\n'
                  f'/list_habits - посмотреть перечень всех привычек;\n{'*'*31}\n'
                  f'/check 12 - Отметить выполнение сегодня, или\nза указанную дату с комментарием:\n'
                  f'/check 12 2025-12-03 | Выпил 2 л\n{'*'*31}\n'
                  f'/uncheck - удалить отметку, формат:\n/uncheck 12 2025-12-02;\n{'*'*31}\n'
                  f'/edit_habit - Редактировать привычку, формат:\n'
                  f'/edit_habit 12 Пить воду — немного меньше | еженедельно\n{'*'*31}\n'
                  f'/get_habit - Получить детали привычки, формат:\n/get_habit 12;\n{'*'*31}\n'
                  f'/delete_habit - удаление привычки, формат:\n'
                  f'/delete_habit 12, удаляет привычку с id=12\n{'*'*31}\n'
                  f'/stats - статус привычки\n/stats 12 7 Статус за 7 или 30 дней выводит статистику выполнения привычки '
                  f'с id = 12\n{'*'*31}\n',
        'Привычка добавлена':'Прекрасно, ваша привычка:\n{habit}'
               f'\nуспешно добавлена 👍',
        'Привычка удалена':'Ваша привычка:\n{habit}\nуспешно удалена ❌',
        'Нет привычек':'Уважаемый {username} информирую: у вас нет ни одной привычки 🤔\n',
        'Отметка добавлена': 'Прекрасно, ваша отметка:\n{habit}\nуспешно добавлена 👍',
        'Отметка удалена': 'Ваша отметка с id = {id} на дату: {date_} успешно удалена ❌',
        'Нет отметок':'У вас нет отметок привычки с id = {id}',
        'Нет отметок на дату':'У вас нет отметок привычки с id = {id} на дату {date_}',
        'Неверный id':'Вы передали id = {id}, что не допустимо, id должно быть положительное целое число. Повторите ввод',
        'Нет параметров':'Вы не передали ни единого параметра для отметки привычки, повторите ввод',
        'Нет даты':'Вы не передали параметр дата в формате: 2013-05-19',
        'Привычка изменена':'''Ваша привычка изменена:\nБыло:\n{it_was}\nСтало:\n{it_became}''',
        'Неверная дата':'Вы передали параметр даты, но такой даты:\n{date_} не существует\nТребуемый формат: 2013-05-19.\nПовторите ввод',
        'Неверная частота':'''Вы передали неверный параметр частоты привычки в команду /add_habits!
Правильный формат: /add_habits пить воду | X, где Х не указано, либо одно значение из перечня:
ежедневно, еженедельно, ежемесячно, ежегодно, произвольно.
Для не указанного значения частота привычки будет  - произвольно.
Повторите ввод команды''',
        'Нет частоты':'''Вы не передали параметры частоты привычки в команду /add_habits!
Правильный формат: /add_habits пить воду | X, где Х не указано, либо одно значение из перечня:
ежедневно, еженедельно, ежемесячно, ежегодно, произвольно.
Для не указанного значения частота привычки будет  - произвольно.
Повторите ввод команды''',
        'Неверный параметр редактирования':'''Вы передали неверные параметры имени и частоты привычки в команду /edit_habit!
Правильный формат: /edit_habit пить воду | X, где Х не указано, либо одно значение из перечня:
ежедневно, еженедельно, ежемесячно, ежегодно, произвольно.
Для не указанного значения частота привычки будет  - произвольно.
Повторите ввод команды''',
        'Нет имени привычки':'Вы не указали имя привычки после id',
        'Неверная частота ред':'''Вы передали неверный параметр частоты привычки в команду /edit_habit!
Правильный формат: /edit_habit пить воду | X, где Х не указано, либо одно значение из перечня:
ежедневно, еженедельно, ежемесячно, ежегодно, произвольно.
Для не указанного значения частота привычки будет  - произвольно.
Повторите ввод команды''',
        'Неверная команда':'''Вы ввели команду:\n{text}\nданная команда мне не известна⁉️ 🤔\n\n
Список доступных команд:\n/help\n\nпопробуйте ещё раз ✍️, у вас обязательно получится 👇''',
    }
    return info_for_user


