from datetime import date

class Habit:
    def __init__(self, name: str, frequency: str, created_at: date):
        self.name = name
        self.frequency = frequency
        self.created_at = created_at

    def __str__(self) -> str:
        return (
            f'- Ваша привычка: {self.name}\n'
            f'- Частота использования: {self.frequency}\n'
            f'- Дата создания: {self.created_at.strftime('%d.%m.%Y')}\n👍'
        )


def logic_add_habits(data: str):
    freq = {'ежедневно', 'еженедельно', 'ежемесячно', 'ежегодно', 'произвольно'}
    res = None
    name = None
    frequency = None
    if not data:
        res = f'''Вы не передали параметры частоты привычки в команду /add_habits!
Правильный формат: /add_habits пить воду | X, где Х не указано, либо одно значение из перечня:
ежедневно, еженедельно, ежемесячно, ежегодно, произвольно.
Для не указанного значения частота привычки будет  - произвольно.
Повторите ввод команды'''
    elif len(data.split('|')) == 1:
        name = data.split('|')[0].strip()
        frequency = 'произвольно'
    elif len(data.split('|')) == 2 and data.split('|')[1].strip() not in freq and data.split('|')[1].strip() != '':
        res = f'''Вы передали неверный параметр частоты привычки в команду /add_habits!
Правильный формат: /add_habits пить воду | X, где Х не указано, либо одно значение из перечня:
ежедневно, еженедельно, ежемесячно, ежегодно, произвольно.
Для не указанного значения частота привычки будет  - произвольно.
Повторите ввод команды'''
    elif len(data.split('|')) == 2 and data.split('|')[1].strip() not in freq and data.split('|')[1].strip() == '':
        name = data.split('|')[0].strip()
        frequency = 'произвольно'
    elif len(data.split('|')) == 2 and data.split('|')[1].strip() in freq:
        name = data.split('|')[0].strip()
        frequency = data.split('|')[1].strip()
    return res, name, frequency